re_pat_home = [
    ["おはよ|オハヨ|お早う|ぽきた|ｵﾊﾖｳ|オッハー",[
        "おはようございます。{screen_name}さん。",
        "おはようございます！{screen_name}さん。"
    ]],
    
    ["こんにちは|こんちは|こんにちわ|こんちわ",[
        "こんにちは。{screen_name}さん。",
        "こんにちは！{screen_name}さん。"
    ]],
    
    ["(こんばん|コンバン|今晩)(は|わ|ハ|ワ)",[
        "こんばんは。{screen_name}さん。",
        "こんばんは。{screen_name}さん。"
    ]],
    
    ["おやす|オヤス|お休み|ねます|寝る|寝ます|ぽや",[
        "よい夢を。{screen_name}さん。",
        "おやすみなさい。{screen_name}さん。"
    ]],
    
    ["行ってきます|行ってくる|いってきます|いってくる",[
        "お気をつけて。{screen_name}さん。",
        "{screen_name}さん、行ってらっしゃい！"
    ]],
    
    ["帰りました|ただいま|帰宅",[
        "おかえりなさい。{screen_name}さん。"
    ]],
    
    ["疲れた|つかれた|つかれました",[
        "{screen_name}さん、お疲れ様です。",
        "{screen_name}さん、ごゆっくりお休みください。"
    ]],

    ["#新しいプロフィール画像",[
        "素敵なアイコンですね。"
    ]]
]